RIOT-OS/RIOT/cpu/cc26x2_cc13x2/radio/cc26x2_cc13x2_rf_internal.c
/*
 * Copyright (C) 2020 Locha Inc
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup         cpu_cc26x2_cc13x2
 * @{
 *
 * @file
 * @brief           CC13x2 IEEE 802.15.4 netdev driver
 *
 * @author          Jean Pierre Dudey <jeandudey@hotmail.com>
 * @}
 */

#include <errno.h>
#include <string.h>

#include "cc26x2_cc13x2_rf_internal.h"
#include "cc26x2_cc13x2_rfc.h"
#include "vendor/rf_patch_cpe_prop.h"
#include "rf_conf.h"

#include "net/ieee802154.h"

#include "byteorder.h"

#define ENABLE_DEBUG 0
#include "debug.h"

#define PREAMBLE_LEN        (4U)    /**< Preamble length in bytes */

#define RX_BANDWIDTH_310KHZ (0x59)  /**< RX bandwidth */
#define RX_BANDWIDTH_190KHZ (0x56)  /**< RX bandwidth */

/**
 * @brief   Transmit buffer length.
 *
 * Format is:
 *
 * ```
 * +-----+------+
 * | PHR | PSDU |
 * +-----+------+
 * ```
 */
#define TX_BUF_LEN         ALIGN_TO_4(IEEE802154_PHY_MR_FSK_PHR_LEN + \
                                      IEEE802154G_FRAME_LEN_MAX)

/**
 * @brief   Receive buffer length.
 *
 * This is the length of an individual receive buffer.
 *
 * Format is:
 *
 * ```
 * +------------------+------+--------+
 * | rfc_data_entry_t | PSDU | Status |
 * +------------------+------+--------+
 * ```
 */
#define RX_BUF_LEN         ALIGN_TO_4(sizeof(rfc_data_entry_t) + \
                                      IEEE802154G_FRAME_LEN_MAX +  \
                                      CC26X2_CC13X2_RF_RX_STATUS_LEN)

static uint8_t _tx_buf[TX_BUF_LEN]  __attribute__ ((aligned(4))); /**< Transmit buffer */
static rfc_data_queue_t _rx_queue __attribute__ ((aligned(4)));  /**< Receive data queue */
/** Receive buffer configured as a circular buffer, e.g.: the last one points
 * to the first, each buffer contains @ref rfc_data_entry_t which is used
 * by the RF Core to mark the buffers that have available data when a packet
 * is received, each buffer represents a different packet. */
static uint8_t _rx_buf[CONFIG_CC26x2_CC13X2_RF_RX_BUF_NUMOF][RX_BUF_LEN] __attribute__ ((aligned(4)));

static rfc_ratmr_t _rat_offset;     /**< Radio timer offset */

static int16_t _tx_pwr;             /**< Transmit power used */
static uint16_t _channel;           /**< Current channel */

static uint8_t _short_addr[IEEE802154_SHORT_ADDRESS_LEN];
static uint8_t _long_addr[IEEE802154_LONG_ADDRESS_LEN];
static uint16_t _pan_id;

enum {
    STATE_RFC_POWER_ON,
    STATE_RFC_SETUP,
    STATE_FINISHED,
} _poweron_state;

/* override_prop_common.xml
 * DC/DC regulator: In Tx, use DCDCCTL5[3:0]=0x7 (DITHER_EN=0 and IPEAK=7).
 */
#define OVERRIDE_DCDCCTL5_REG           ((uint32_t)0x00F788D3)
/* override_prop_common_sub1g.xml. Set RF_FSCA.ANADIV.DIV_SEL_BIAS = 1.
 * Bits [0:16, 24, 30] are don't care..
 */
#define OVERRIDE_RF_FSCA_0              ((uint32_t)0x4001405D)
/* Set RF_FSCA.ANADIV.DIV_SEL_BIAS = 1. Bits [0:16, 24, 30] are don't care.. */
#define OVERRIDE_RF_FSCA_1              ((uint32_t)0x08141131)
/* override_tc106.xml. Tx: Configure PA ramp time, PACTL2.RC=0x3 (in ADI0, set
 * PACTL2[4:3]=0x3) */
#define OVERRIDE_PA_RAMP_TIME \
    RFC_ADI_2HALFREG_OVERRIDE(0, 16, 0x8, 0x8, 17, 0x1, 0x1)
/* Rx: Set AGC reference level to 0x1A (default: 0x2E) */
#define OVERRIDE_AGC_REFERENCE_LEVEL    RFC_HW_REG_OVERRIDE(0x609C, 0x001A)
/* Rx: Set RSSI offset to adjust reported RSSI by -1 dB (default: -2),
 * trimmed for external bias and differential configuration
 */
#define OVERRIDE_RSSI_OFFSET            ((uint32_t)0x000188A3)
/* Rx: Set anti-aliasing filter bandwidth to 0xD (in ADI0, set
 * IFAMPCTL3[7:4]=0xD) */
#define OVERRIDE_ANTI_ALIAS_BW          RFC_ADI_HALFREG_OVERRIDE(0,61,0xF,0xD)
/* Tx: Set wait time before turning off ramp to 0x1A (default: 0x1F) */
#define OVERRIDE_RAMP_OFF_WAIT_TIME     RFC_HW_REG_OVERRIDE(0x6028,0x001A)
/* TX power override
 * Tx: Set PA trim to max to maximize its output power
 * (in ADI0, set PACTL0=0xF8) */
#define OVERRIDE_PACTL                  RFC_ADI_REG_OVERRIDE(0,12,0xF8)

/**
 * @brief   RF propietary mode radio register overrides.
 *
 * These overrides are the defaults provided by Texas Instruments
 * using the SmartRF software for Sub-GHz. It's all the same on
 * the Sub-GHz family. However some custom boards may need
 * specific trims, if using external PAs for example, to adjust
 * the RSSI offset, PA, etc.
 *
 * This can be defined in the rf_conf.h file if custom overrides
 * are needed.
 */
#ifndef CC26X2_CC13X2_RF_PROP_OVERRIDE
#define CC26X2_CC13X2_RF_PROP_OVERRIDE \
    { \
        OVERRIDE_DCDCCTL5_REG, \
        OVERRIDE_RF_FSCA_0, \
        OVERRIDE_RF_FSCA_1, \
        OVERRIDE_PA_RAMP_TIME, \
        OVERRIDE_AGC_REFERENCE_LEVEL, \
        OVERRIDE_RSSI_OFFSET, \
        OVERRIDE_ANTI_ALIAS_BW, \
        OVERRIDE_RAMP_OFF_WAIT_TIME, \
        OVERRIDE_PACTL, \
        RFC_END_OVERRIDE, \
    }
#endif

/** Overrides for CMD_PROP_RADIO_DIV_SETUP. */
static uint32_t rf_prop_overrides[] = CC26X2_CC13X2_RF_PROP_OVERRIDE;

/**
 * CMD_SYNC_START_RAT
 *
 * This commands starts the Radio Timer, needed to run time-dependant radio
 * operations, and to chain commands. We only use the parameter `rat0` which
 * is the previous RAT offset when it was stopped using CMD_SYNC_STOP_RAT,
 * if no previous offset is present, 0 is fine.
 */
rfc_cmd_sync_start_rat_t rf_cmd_sync_start_rat =
{
    .command_no = RFC_CMD_SYNC_START_RAT,
    .status = RFC_IDLE,
    .next_op = NULL, /* set by us */
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0,
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0,
    },
    .__dummy0 = 0,
    .rat0 = 0, /* set by us */
};

/**
 * CMD_PROP_RADIO_DIV_SETUP
 *
 * This is the "setup" command for the radio, sets the necessary parameters for
 * TX/RX and some configuration of the modulation, whitening, packet format,
 * symbol rate, preamble configuration, receiver bandwidth, intermediate
 * frequency, center frequency.
 */
rfc_cmd_prop_radio_div_setup_t rf_cmd_prop_radio_div_setup =
{
    .command_no = RFC_CMD_PROP_RADIO_DIV_SETUP,
    .status = RFC_IDLE,
    .next_op = NULL, /* set by us */
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0
    },
    .modulation = {
        .mod_type = RFC_MOD_TYPE_GFSK,
        .deviation = 0x64,
        .deviation_step_sz = RFC_DEV_STEP_SZ_250_HZ
    },
    .symbol_rate = {
        .prescale = 15,
        .rate_word = 0x8000,
        .decim_mode = RFC_DECIM_MODE_AUTO
    },
    .rx_bw = RX_BANDWIDTH_190KHZ,
    .pream_conf = {
        .pream_bytes = PREAMBLE_LEN,
        .pream_mode = RFC_PREAM_MODE_0_FIRST,
    },
    .format_conf = {
        .sw_bits = IEEE802154_PHY_MR_FSK_2FSK_SFD_LEN * 8,
        .bit_reversal = 0,
        .msb_first = 1,
        .fec_mode = 0,
        .whiten_mode = RFC_WHITEN_MODE_IEEE802154G_CRC
    },
    .config = {
        .front_end_mode = 0,
        .bias_mode = RFC_BIAS_MODE_EXTERNAL,
        .analog_cfg_mode = 0,
        .no_fs_powerup = 0
    },
    .tx_power = 0x04C0,
    .reg_override = rf_prop_overrides,
    .center_freq = 0x0363,
    .int_freq = 0x8000,
    .lo_divider = 0x05
};

/**
 * CMD_FS
 *
 * The Frequency Sinthesizer command, sets the channel frequency.
 */
rfc_cmd_fs_t rf_cmd_fs =
{
    .command_no = RFC_CMD_FS,
    .status = RFC_IDLE,
    .next_op = NULL, /* set by us */
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0
    },
    .frequency = 0, /* set by us */
    .fract_freq = 0, /* set by us */
    .synth_conf = {
        .txmode = 0,
        .ref_freq = 0
    },
    .__dummy0 = 0,
    .__dummy1 = 0,
    .__dummy2 = 0,
    .__dummy3 = 0
};

/**
 * CMD_PROP_TX_ADV
 *
 * Advanced proprietary transmission. Despite the "proprietary" name, it's
 * compatible with IEEE 802.15.4g. Fields set at runtime are: pkt and pkt_len.
 */
rfc_cmd_prop_tx_adv_t rf_cmd_prop_tx_adv =
{
    .command_no = RFC_CMD_PROP_TX_ADV,
    .status = RFC_IDLE,
    .next_op = NULL, /* set by us */
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0
    },
    .pkt_conf = {
        .fs_off = 0,
        .use_crc = 1,
        .crc_inc_sw = 0,
        .crc_inc_hdr = 0
    },
    .num_hdr_bits = IEEE802154_PHY_MR_FSK_PHR_LEN * 8,
    .pkt_len = 0, /*< set by us */
    .start_conf = {
        .ext_tx_trig = 0,
        .input_mode = 0,
        .source = 0
    },
    .pre_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .pre_time = 0,
    .sync_word = IEEE802154_PHY_MR_FSK_2FSK_UNCODED_SFD_0,
    .pkt = 0 /* set by us */
};

/**
 * CMD_PROP_RX_ADV
 *
 * Advanced proprietary RX. Sets the radio into RX mode, it keeps putting
 * the RX queue. This command does not finish unless it's aborted/stopped.
 */
rfc_cmd_prop_rx_adv_t rf_cmd_prop_rx_adv =
{
    .command_no = RFC_CMD_PROP_RX_ADV,
    .status = RFC_IDLE,
    .next_op = NULL, /* set by us */
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0
    },
    .pkt_conf = {
        .fs_off = 0,
        .repeat_ok = 1,
        .repeat_nok = 1,
        .use_crc = 1,
        .crc_inc_sw = 0,
        .crc_inc_hdr = 0,
        .end_type = 0,
        .filter_op = 1
    },
    .rx_conf = {
        .auto_flush_ignored = 1,
        .auto_flush_crc_err = 1,
        .include_hdr = 0,
        .include_crc = 0,
        .append_rssi = 1,
        .append_timestamp = 0,
        .append_status = 0
    },
    .sync_word0 = IEEE802154_PHY_MR_FSK_2FSK_UNCODED_SFD_0,
    .sync_word1 = 0 /*IEEE802154_PHY_MR_FSK_2FSK_UNCODED_SFD_1*/,
    .max_pkt_len = IEEE802154G_FRAME_LEN_MAX,
    .hdr_conf = {
        .num_hdr_bits = IEEE802154_PHY_MR_FSK_PHR_LEN * 8,
        .len_pos = 0,
        .num_len_bits = 11
    },
    .addr_conf = {
        .addr_type = 0,
        .addr_size = 0,
        .addr_pos = 0,
        .num_addr = 0
    },
    .len_offset = -4,
    .end_trigger = {
        .type = RFC_TRIG_NEVER,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .end_time = 0,
    .addr = 0, /* unused */
    .queue = 0, /* set by us */
    .output = 0 /* set by us */
};

/** Carrier sense command, used to perform CCA */
rfc_cmd_prop_cs_t rf_cmd_prop_cs =
{
    .command_no = RFC_CMD_PROP_CS,
    .status = RFC_IDLE,
    .next_op = NULL,
    .start_time = 0,
    .start_trigger = {
        .type = RFC_TRIG_NOW,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .condition = {
        .rule = RFC_COND_NEVER,
        .skip_no = 0
    },
    .fs_conf = {
        /* we don't want to turn off the Frequency Synthesizer after a
         * carrier sense command */
        .off_idle = 0,
        .off_busy = 0,
    },
    .__dummy0 = 0,
    .conf = {
        .ena_rssi = 1, /* use RSSI as the measurement parameter */
        .ena_corr = 0,
        .operation = 0,
        /* stop either on Busy or Idle */
        .busy_op = 1,
        .idle_op = 1,
        .timeout_res = 0,
    },
    .rssi_thr = -80, /* SHOULD be set by us, through hal or netdev */
    .num_rssi_idle = 1, /* consecutive RSSI measurements to mark channel as
                           Idle */
    .num_rssi_busy = 1, /* consecutive RSSI measurements to mark channel as
                           Busy */
    .corr_period = 0,
    .corr_config = {
        .num_corr_inv = 0,
        .num_corr_busy = 0,
    },
    /* end trigger is not used, as Carrier Sense will stop
     * on an Idle/Busy channel. */
    .end_trigger = {
        .type = RFC_TRIG_NEVER,
        .ena_cmd = 0,
        .trigger_no = 0,
        .past_trig = 0
    },
    .end_time = 0,
};

/** Command to clear the RX queue */
rfc_cmd_clear_rx_t rf_cmd_clear_rx =
{
    .command_no = RFC_CMD_CLEAR_RX,
    .__dummy0 = 0,
    .queue = NULL /* set by us */
};

/** Set TX power */
rfc_cmd_set_tx_power_t rf_cmd_set_tx_power =
{
    .command_no = RFC_CMD_SET_TX_POWER,
    .tx_power = 0,
};

void cc26x2_cc13x2_rf_internal_init(void)
{
    /* Initialize data entries as general, with a length field of 2 bytes
     * (uint16_t) and the correct RX buffer size */
    for (unsigned i = 0; i < CONFIG_CC26x2_CC13X2_RF_RX_BUF_NUMOF; i++) {
        /* verify that the compiler put our RX buffers on aligned memory */
        assert(((uintptr_t)_rx_buf[i] & 0x3) == 0);

