RIOT-OS/RIOT/cpu/cc26x2_cc13x2/radio/cc26x2_cc13x2_rf_internal.c
        /* the initial bytes of an RX buffer is the rfc_data_entry_t structure */
        rfc_data_entry_t *entry = (rfc_data_entry_t *)_rx_buf[i];

        entry->status = RFC_DATA_ENTRY_PENDING;
        entry->config.type = RFC_DATA_ENTRY_TYPE_GEN;
        entry->config.lensz = sizeof(uint16_t);
        entry->length = RX_BUF_LEN - sizeof(rfc_data_entry_t);

        if ((i + 1) == CONFIG_CC26x2_CC13X2_RF_RX_BUF_NUMOF) {
            /* Point to the first entry if this is the last */
            entry->next_entry = _rx_buf[0];
        }
        else {
            entry->next_entry = _rx_buf[i + 1];
        }
    }

    /* Put a pointer to the receive buffers on the received queue, last entry is
     * null, this to make a circular buffer */
    _rx_queue.curr_entry = _rx_buf[0];
    _rx_queue.last_entry = NULL;

    rf_cmd_prop_rx_adv.queue = &_rx_queue;
    rf_cmd_clear_rx.queue = &_rx_queue;

    _channel = CC26X2_CC13X2_RF_CHAN_MIN;
    uint64_t default_freq = cc26x2_cc13x2_rf_chan_freq(_channel);
    cc26x2_cc13x2_rf_freq_convert(default_freq,
                                  &rf_cmd_fs.frequency,
                                  &rf_cmd_fs.fract_freq);

    cc26x2_cc13x2_rf_pa_t *pa_val = &cc26x2_cc13x2_rf_patable[0];
    _tx_pwr = pa_val->dbm;

    rf_cmd_prop_radio_div_setup.condition.rule = RFC_COND_ALWAYS;
    rf_cmd_prop_radio_div_setup.condition.skip_no = 0;
    rf_cmd_prop_radio_div_setup.next_op = (rfc_op_t *)&rf_cmd_fs;
    rf_cmd_prop_radio_div_setup.tx_power = pa_val->val;

    rf_cmd_sync_start_rat.next_op = &rf_cmd_prop_radio_div_setup;
    rf_cmd_sync_start_rat.condition.rule = RFC_COND_ALWAYS;
    rf_cmd_sync_start_rat.rat0 = _rat_offset;

    memset(_short_addr, 0, IEEE802154_SHORT_ADDRESS_LEN);
    memset(_long_addr, 0, IEEE802154_LONG_ADDRESS_LEN);
    memset(&_pan_id, 0, sizeof(uint16_t));
    DEBUG("[cc26x2_cc13x2_rf]: radio initialised\n");
}

void cc26x2_cc13x2_rf_request_on(void)
{
    cc26x2_cc13x2_rfc_request_on();
    _poweron_state = STATE_RFC_POWER_ON;
}

int cc26x2_cc13x2_rf_confirm_on(void)
{
    uint32_t cmdsta;
    (void)cmdsta;

    switch (_poweron_state) {
        case STATE_RFC_POWER_ON:
            if (cc26x2_cc13x2_rfc_confirm_on() != 0) {
                return -EAGAIN;
            }
            cc26x2_cc13x2_rfc_finish_on(rf_patch_cpe_prop);
            cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_sync_start_rat);
            assert((cmdsta & 0xFF) == RFC_CMDSTA_DONE);
            _poweron_state = STATE_RFC_SETUP;
            return -EAGAIN;

        case STATE_RFC_SETUP:
            if (cc26x2_cc13x2_rfc_confirm_execute() != 0) {
                return -EAGAIN;
            }
            _poweron_state = STATE_FINISHED;
            return 0;

        case STATE_FINISHED:
            break;

        default:
            assert(0);
    }

    return 0;
}

int cc26x2_cc13x2_rf_request_cca(void)
{
    uint32_t cmdsta;

    rf_cmd_prop_cs.status = RFC_IDLE;
    cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_prop_cs);
    if ((cmdsta & 0xFF) != RFC_CMDSTA_DONE) {
        DEBUG("[cc26x2_cc13x2_rf]: CMD_PROP_CS failed with cmdsta=%08lx",
              cmdsta);
        return -EIO;
    }

    return 0;
}

bool cc26x2_cc13x2_rf_rx_is_on(void)
{
    return rf_cmd_prop_rx_adv.status == RFC_ACTIVE;
}

int cc26x2_cc13x2_rf_rx_start(void)
{
    uint32_t cmdsta;

    DEBUG_PUTS("rx");

    /* if netdev or IEEE 802.15.4g HAL don't clear up the buffers by calling
     * recv/indication_rx the buffer might fill up, this is the case for
     * netdev as when receiving packets too fast gnrc_netif might not handle
     * them as fast as we want, so in either case if these packets aren't handled
     * just drop them.
     *
     * TODO: what about re-generating the ISR event and return -EBUSY here to
     * avoid the loss of these packets? */
    if (rf_cmd_prop_rx_adv.status == RFC_PROP_ERROR_RXBUF) {
        DEBUG("[cc26x2_cc13x2_rf]: clearing RX queue\n");
        cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_clear_rx);
        assert((cmdsta & 0xFF) == RFC_CMDSTA_DONE);
        rf_cmd_prop_rx_adv.status = RFC_IDLE;
    }

    rf_cmd_prop_rx_adv.queue = &_rx_queue;
    cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_prop_rx_adv);
    if ((cmdsta & 0xFF) == RFC_CMDSTA_SCHEDULINGERROR) {
        DEBUG("[cc26x2_cc13x2_rf]: scheduling error");
        cc26x2_cc13x2_rfc_abort_cmd();

        /* this time should work */
        cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_prop_rx_adv);
    }

    if ((cmdsta & 0xFF) != RFC_CMDSTA_DONE) {
        rf_cmd_prop_rx_adv.status = RFC_IDLE;
        return -EIO;
    }

    return 0;
}

void cc26x2_cc13x2_rf_rx_stop(void)
{
    DEBUG_PUTS("stop");
    assert(cc26x2_cc13x2_rf_rx_is_on());
    cc26x2_cc13x2_rfc_abort_cmd();
    rf_cmd_prop_rx_adv.status = RFC_IDLE;
}

rfc_data_entry_general_t *cc26x2_cc13x2_rf_recv(void)
{
    return (rfc_data_entry_general_t *)cc26x2_cc13x2_rfc_queue_recv(&_rx_queue);
}

int cc26x2_cc13x2_rf_write(const iolist_t *iolist)
{
    DEBUG_PUTS("write");
    const size_t max_psdu_len = TX_BUF_LEN - IEEE802154_PHY_MR_FSK_PHR_LEN;
    const size_t fcs_len = sizeof(uint16_t);
    size_t total_len;
    size_t psdu_len = 0;

    /* PHY header size reserved (two bytes), after the PHR the
     * PSDU starts */
    uint8_t *buf_pos = _tx_buf + IEEE802154_PHY_MR_FSK_PHR_LEN;
    for (const iolist_t *iol = iolist; iol; iol = iol->iol_next) {
        psdu_len += iol->iol_len;
        if (psdu_len > max_psdu_len) {
            return -EOVERFLOW;
        }

        memcpy(buf_pos, iol->iol_base, iol->iol_len);
        buf_pos += iol->iol_len;
    }

    /* Length in MR-FSK PHR. Includes the PSDU + FCS */
    total_len = psdu_len + fcs_len;
    if (total_len > IEEE802154G_FRAME_LEN_MAX) {
        return -EOVERFLOW;
    }

    /* Prepare the MR-FSK PHR
     * - No mode switching.
     * - Total length: PSDU + FCS length
     * - FCS type (CRC-16)
     *
     * Total length = len (payload) + CRC length
     *
     * The Radio will flip the bits around, so _tx_buf[0] must have the
     * length LSBs (PHR[15:8] and _tx_buf[1] will have PHR[7:0]
     */
    _tx_buf[0] = (((total_len) >> 0) & 0xFF);
    _tx_buf[1] = (((total_len) >> 8) & 0xFF) + 0x08 + 0x10;

