RIOT-OS/RIOT/cpu/cc26x2_cc13x2/radio/cc26x2_cc13x2_rf_internal.c
    /* The length of the buffer used to transmit is the PHR + PSDU,
     * it does not include the FCS size as the radio writes it on
     * it's own depending on the configured FCS, which is CRC-16 in
     * our case */
    rf_cmd_prop_tx_adv.pkt_len = IEEE802154_PHY_MR_FSK_PHR_LEN + psdu_len;
    rf_cmd_prop_tx_adv.pkt = _tx_buf;
    rf_cmd_prop_tx_adv.status = RFC_IDLE;

    return 0;
}

int cc26x2_cc13x2_rf_request_transmit(void)
{
    DEBUG_PUTS("tx");
    uint32_t cmdsta;

    cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_prop_tx_adv);
    switch (cmdsta & 0xFF) {
        case RFC_CMDSTA_DONE:
            break;
        /* previous command, if any, has not been finished */
        case RFC_CMDSTA_SCHEDULINGERROR:
            return -EBUSY;
        default:
            DEBUG("[cc26x2_cc13x2_rf]: couldn't send TX command, cmdsta=%08lx\n",
                  cmdsta);
            return -EIO;
    }

    return 0;
}

size_t cc26x2_cc13x2_rf_tx_psdu_len(void)
{
    return rf_cmd_prop_tx_adv.pkt_len - IEEE802154_PHY_MR_FSK_PHR_LEN;
}

void cc26x2_cc13x2_rf_set_cca_threshold(int8_t threshold)
{
    (void)threshold;
    rf_cmd_prop_cs.rssi_thr = threshold;
}

int cc26x2_cc13x2_rf_change_chan(uint16_t channel)
{
    const uint16_t min_chan = CC26X2_CC13X2_RF_CHAN_MIN;
    const uint16_t max_chan = CC26X2_CC13X2_RF_CHAN_MAX;
    uint32_t cmdsta;

    if (!(channel >= min_chan &&
          channel <= max_chan)) {
        DEBUG("[cc26x2_cc13x2_rf]: invalid channel value=%u\n", channel);
        return -EINVAL;
    }

    uint64_t new_freq  = cc26x2_cc13x2_rf_chan_freq(channel);
    cc26x2_cc13x2_rf_freq_convert(new_freq,
                                  &rf_cmd_fs.frequency,
                                  &rf_cmd_fs.fract_freq);

    RFC_DBELL->RFCPEIFG = ~CPE_IRQ_LAST_COMMAND_DONE;
    cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_fs);
    if ((cmdsta & 0xFF) != RFC_CMDSTA_DONE) {
        DEBUG("[cc26x2_cc13x2_rf]: couldn't change channel, cmdsta=%08lx",
              cmdsta);
        return -EIO;
    }
    while (cc26x2_cc13x2_rfc_confirm_execute() == -EAGAIN) {}

    assert(rf_cmd_fs.status = RFC_DONE_OK);

    _channel = channel;

    return 0;
}

int cc26x2_cc13x2_rf_set_tx_pwr(int16_t pow)
{
    uint32_t cmdsta;
    cc26x2_cc13x2_rf_pa_t *match = &cc26x2_cc13x2_rf_patable[0];

    for (unsigned i = 0; i < CC26X2_CC13X2_PA_TABLE_NUMOF; i++) {
        if (cc26x2_cc13x2_rf_patable[i].dbm >= pow) {
            match = &cc26x2_cc13x2_rf_patable[i];
        }
        else {
            break;
        }
    }

    DEBUG("[cc26x2_cc13x2_rf]: found matching TX power %"PRIi16" dBm (for %"PRIi16" dBm)\n",
          match->dbm, pow);

    _tx_pwr = match->dbm;
    rf_cmd_set_tx_power.tx_power = match->val;

    /* execute the command, it is immediate */
    cmdsta = cc26x2_cc13x2_rfc_request_execute((uintptr_t)&rf_cmd_set_tx_power);
    if ((cmdsta & 0xFF) != RFC_CMDSTA_DONE) {
        DEBUG("[cc26x2_cc13x2_rf]: couldn't set TX power to %"PRIi16" dBm",
              match->dbm);
        return -EIO;
    }

    return 0;
}

int16_t cc26x2_cc13x2_rf_get_tx_pwr(void)
{
    return _tx_pwr;
}

eui64_t cc26x2_cc13x2_rf_get_hwaddr(void)
{
    eui64_t ret;
    size_t i;
    uint8_t *hwaddr;
    assert(IEEE802154_LONG_ADDRESS_LEN == sizeof(uint64_t));

    /* The IEEE MAC address can be stored in two places. We check the Customer
     * Configuration to see if it has a valid HW address. */
    hwaddr = (uint8_t *)&CCFG->IEEE_MAC_0;
    for (i = 0; i < IEEE802154_LONG_ADDRESS_LEN; i++) {
        if (hwaddr[i] != 0xFF) {
            break;
        }
    }

    if (i == IEEE802154_LONG_ADDRESS_LEN) {
        /* The CCFG address was all 0xFF (empty), switch to the fcfg which
         * always has a valid HW address from factory */
        hwaddr = (uint8_t *)&FCFG->MAC_15_4_0;
    }

    /* The IEEE MAC address is stored in network byte order. */
    memcpy(ret.uint8, hwaddr, IEEE802154_LONG_ADDRESS_LEN);
    return ret;
}

void cc26x2_cc13x2_rf_set_short_addr(network_uint16_t short_addr)
{
    memcpy(_short_addr, short_addr.u8, IEEE802154_SHORT_ADDRESS_LEN);
}

void cc26x2_cc13x2_rf_set_long_addr(eui64_t long_addr)
{
    memcpy(_long_addr, long_addr.uint8, IEEE802154_LONG_ADDRESS_LEN);
}

void cc26x2_cc13x2_rf_set_pan_id(uint16_t pan_id)
{
    _pan_id = pan_id;
}

bool cc26x2_cc13x2_rf_l2_filter(uint8_t *mhr)
{
    uint8_t dst_addr[IEEE802154_LONG_ADDRESS_LEN];
    le_uint16_t dst_pan;
    uint8_t pan_bcast[] = IEEE802154_PANID_BCAST;

    int addr_len = ieee802154_get_dst(mhr, dst_addr, &dst_pan);
    if (addr_len < 0) {
        return false;
    }

    /* filter PAN ID */
    /* Will only work on little endian platform (all cc26xx/cc13xx ;-) ) */
    if ((memcmp(pan_bcast, dst_pan.u8, 2) != 0) &&
        (memcmp(&_pan_id, dst_pan.u8, 2) != 0)) {
        return false;
    }

    /* check destination address */
    if (((addr_len == IEEE802154_SHORT_ADDRESS_LEN) &&
          (memcmp(_short_addr, dst_addr, addr_len) == 0 ||
           memcmp(ieee802154_addr_bcast, dst_addr, addr_len) == 0)) ||
        ((addr_len == IEEE802154_LONG_ADDRESS_LEN) &&
          (memcmp(_long_addr, dst_addr, addr_len) == 0))) {
        return true;
    }

    return false;
}
